Расчетные_задачи_занятие_3/src/Documents/БольничныйЛист/БольничныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БольничныйЛист</name>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыплаты</name>
    <type>
      <types>EnumRef.ПроцентыВыплатыБольничного</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Расчетные_задачи_занятие_3/src/Documents/БольничныйЛист/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	
	Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	ФизическоеЛицоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФизическоеЛицоПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиСрезПоследних.ФизическоеЛицо,
	|	СотрудникиСрезПоследних.Подразделение,
	|	СотрудникиСрезПоследних.Должность,
	|	СотрудникиСрезПоследних.ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(СотрудникиСрезПоследних.Период, &Дата, ГОД) < 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПроцентыВыплатыБольничного._60)
	|		КОГДА РАЗНОСТЬДАТ(СотрудникиСрезПоследних.Период, &Дата, ГОД) >= 3
	|				И РАЗНОСТЬДАТ(СотрудникиСрезПоследних.Период, &Дата, ГОД) < 6
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПроцентыВыплатыБольничного._80)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПроцентыВыплатыБольничного._100)
	|	КОНЕЦ КАК ПроцентВыплаты
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(&Дата, ФизическоеЛицо = &ФизическоеЛицо) КАК СотрудникиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ФизическоеЛицо", Объект.ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Объект.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
		Объект.Должность = ВыборкаДетальныеЗаписи.Должность;
		Объект.ГрафикРаботы = ВыборкаДетальныеЗаписи.ГрафикРаботы;
		Объект.ПроцентВыплаты = ВыборкаДетальныеЗаписи.ПроцентВыплаты;
		
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура Группа2ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "Группа4" Тогда
	
		Группа2ПриСменеСтраницыНаСервере();
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Группа2ПриСменеСтраницыНаСервере()
	
	ДГ.Очистить();
	
	Точка = ДГ.УстановитьТочку(Объект.ФизическоеЛицо);
	
	Серия = ДГ.УстановитьСерию("Дни болезни");
	
	ЗначениеДГ = ДГ.ПолучитьЗначение(Точка,Серия);
	Значениедг.Редактирование = Истина;
	
	Интервал = ЗначениеДГ.Добавить();
	
	Интервал.Начало = Объект.ДатаНачала;
	Интервал.Конец = Объект.ДатаОкончания;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ДГПриОкончанииРедактированияИнтервала(Элемент, Интервал, ОтменаРедактирования)
	
	Объект.ДатаНачала 		= Интервал.Начало;
	Объект.ДатаОкончания 	= Интервал.Конец;
	
КонецПроцедуры
